04_OpenFoam/_ref/OpenFOAM-14/multicomponentFluid/SandiaD_LTS/0/N2
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  14
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      N2;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [];

internalField
{
    type        zonal;

    defaultValue    0.77;

    zones
    {
        fuel
        {
            type            box;
            box             (0 -10 -100) (0.0036 10 0);
            value           0.6473;
        }
    }
}

boundaryField
{
    inletCH4
    {
        type            fixedValue;
        value           uniform 0.6473;
    }

    wallOutside
    {
        type            zeroGradient;
    }

    wallTube
    {
        type            zeroGradient;
    }

    inletPilot
    {
        type            fixedValue;
        value           uniform 0.7342;
    }

    inletAir
    {
        type            fixedValue;
        value           uniform 0.77;
    }

    outlet
    {
        type            inletOutlet;
        inletValue      uniform 0.77;
    }

    frontAndBack_pos
    {
        type            wedge;
    }

    frontAndBack_neg
    {
        type            wedge;
    }
}


// ************************************************************************* //
